app/controllers/movies_controller.rb

  def find_moviebydirector
    @movie = Movie.find params[:id]
    director = @movie.director
    if director.nil?
      flash[:notice] = "'#{@movie.title}' has no director info."
      redirect_to movies_path
    else
      @movies = Movie.where(director: director)
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = ?  [["director", "George Lucas"]]

  def destroy
    @movie = Movie.find(params[:id])
    @movie.destroy
---
DELETE FROM "movies" WHERE "movies"."id" = ?  [["id", 1]]